#+TITLE: The Morning Routine - Writing Statistics
#+AUTHOR: Demo Author
#+STARTUP: overview

* Project Goals

- Total word target :: 15,000
- Start date :: 2025-01-15
- Target completion date :: 2025-03-15
- Daily word target :: 500

* Overall Progress

#+NAME: total-progress
| Section  | Target | Actual | Progress |
|----------+--------+--------+----------|
| Act I    |   5000 |   1456 |      29% |
| Act II   |   6000 |    876 |      15% |
| Act III  |   4000 |    515 |      13% |
|----------+--------+--------+----------|
| TOTAL    |  15000 |   2847 |      19% |
#+TBLFM: $4='(format "%.0f%%" (* 100 (/ (float $3) $2)));N::@>$2=vsum(@2..@-1)::@>$3=vsum(@2..@-1)

* Daily Word Log

To update word count, use:
- =C-q w w= (my/ews-org-count-words)
- =C-q w c= (org-context-count-words)
- =C-c 9= (wc-mode)

#+NAME: daily-log
| Date       | Words Written | Cumulative Total | Notes                      |
|------------+---------------+------------------+----------------------------|
| 2025-01-15 |           892 |              892 | First writing session      |
| 2025-01-16 |           762 |             1654 | Finished Chapter 1         |
| 2025-01-17 |          1193 |             2847 | Started Act II, good flow! |
| 2025-01-18 |             0 |             2847 | Rest day                   |
| 2025-01-19 |             0 |             2847 | Planning only              |
#+TBLFM: $3=vsum(@2..@0)::@>$3=vsum(@2..@-1)

* Statistics by Chapter

#+NAME: chapter-words
| Chapter   | Target | Actual | Status        |
|-----------+--------+--------+---------------|
| Chapter 1 |   1500 |    876 | Finished      |
| Chapter 2 |   1500 |    580 | In Progress   |
| Chapter 3 |   2000 |    876 | To Write      |
| Chapter 4 |   2000 |      0 | Pending       |
| Chapter 5 |   1500 |    515 | Outlined      |
| Chapter 6 |   1500 |      0 | Pending       |
| Chapter 7 |   2000 |      0 | Pending       |
| Chapter 8 |   1500 |      0 | Pending       |
| Chapter 9 |   1500 |      0 | Pending       |
|-----------+--------+--------+---------------|
| TOTAL     |  15000 |   2847 | 19% Complete  |
#+TBLFM: @>$2=vsum(@2..@-1)::@>$3=vsum(@2..@-1)

* Time Spent

To log writing time, use:
- =C-c C-x C-i= (org-clock-in)
- =C-c C-x C-o= (org-clock-out)

** Writing Sessions
*** 2025-01-15 First session
:LOGBOOK:
CLOCK: [2025-01-15 Wed 19:30]--[2025-01-15 Wed 21:15] =>  1:45
:END:
*** 2025-01-16 Evening writing
:LOGBOOK:
CLOCK: [2025-01-16 Thu 20:00]--[2025-01-16 Thu 21:30] =>  1:30
:END:
*** 2025-01-17 Morning session
:LOGBOOK:
CLOCK: [2025-01-17 Fri 06:00]--[2025-01-17 Fri 07:00] =>  1:00
CLOCK: [2025-01-17 Fri 20:00]--[2025-01-17 Fri 22:00] =>  2:00
:END:

* Productivity Analysis

** Best day
- Date :: 2025-01-17
- Words :: 1,193
- Hours :: 3:00

** Weekly average
- Words per week :: 2,847 (first week)
- Words per day :: 570 (on writing days)

** Current streak
- Consecutive days writing :: 3
- Last writing day :: 2025-01-17

* Session Notes

** 2025-01-15
:PROPERTIES:
:SESSION-START: 19:30
:SESSION-END: 21:15
:WORDS-WRITTEN: 892
:MOOD: Excited
:END:

*** What I worked on
Started the project! Wrote the opening scene with Alex and the chaotic alarm clock.
The scene flowed really well - I could really visualize Alex's messy bedroom and
the frustration of hitting snooze repeatedly.

*** Progress & Challenges
- Progress: Got Chapter 1, Scene 1 complete
- Challenge: Needed to research typical morning routines to make sure Alex's chaos
  felt realistic but not over-the-top

*** Next Session Goals
- [ ] Finish Scene 2 (coffee shop)
- [ ] Complete Chapter 1
- [ ] Start character development notes for Sam

** 2025-01-16
:PROPERTIES:
:SESSION-START: 20:00
:SESSION-END: 21:30
:WORDS-WRITTEN: 762
:MOOD: Focused
:END:

*** What I worked on
Finished Chapter 1 with the coffee shop scene. Really enjoyed writing the
interaction between Alex and Sam - their dialogue feels natural and Sam's
calm demeanor makes a nice contrast.

*** Progress & Challenges
- Progress: Chapter 1 complete! Both scenes done.
- Challenge: Making Sam helpful without being preachy. Rewrote some dialogue
  to make it more subtle.

*** Next Session Goals
- [ ] Write Chapter 2, Scene 1 (The Decision)
- [ ] Introduce the grandmother's watch
- [ ] Set up Act II

** 2025-01-17
:PROPERTIES:
:SESSION-START: 06:00/20:00
:SESSION-END: 07:00/22:00
:WORDS-WRITTEN: 1193
:MOOD: Productive
:END:

*** What I worked on
Morning session: Finished Chapter 2 with the watch introduction. Really happy
with how the watch became a symbol.

Evening session: Dove into Act II, Scene 1. Alex's first attempt at a routine.
Fun to write their internal monologue as they struggle with meditation.

*** Progress & Challenges
- Progress: Completed Chapter 2, started Act II, got Chapter 3 Scene 1 done
- Challenge: Balancing humor with genuine struggle. Don't want to mock people
  who meditate, but also want to show Alex's realistic difficulty with it.

*** Next Session Goals
- [ ] Continue Act II
- [ ] Write the mentor guidance scene with Sam
- [ ] Plan out Act III resolution
